Repository: MesterPerfect/WikiSearch
Catalog: languages/*/LC_MESSAGES/WikiSearch.po
Languages: ar, es, fr

source: With this program, you can search or browse any Wikipedia article. site: https://github.com/tecwindow/WikiSearch
ar: باستخدام هذا البرنامج ، يمكنك البحث عن أي مقالة في ويكيبيديا أو تصفحها. الموقع: https://github.com/tecwindow/WikiSearch
es: Con este programa podrá buscar o navegar por cualquier artículo de Wikipedia. Enlace al programa: https://github.com/tecwindow/WikiSearch
fr: Avec ce programme, vous pouvez rechercher ou parcourir n'importe quel article de Wikipedia. site : https://github.com/tecwindow/WikiSearch

source: Choose the search language:
ar: اختر لغة البحث:
es: Elija el idioma de búsqueda:
fr: Choisissez la langue de recherche :

source: Enter search words
ar: أدخل كلمات البحث
es: Introduzca su búsqueda
fr: Saisissez les mots de recherche

source: Start search
ar: بدء البحث
es: Buscar
fr: Démarrer la recherche

source: View random articles
ar: عرض مقالات عشوائية
es: Ver artículos aleatorios
fr: Afficher des articles au hasard

source: Close the program
ar: إغلاق البرنامج
es: Cerrar el programa
fr: Fermer le programme

source: &Help file F1
ar: &ملف المساعدة F1
es: &Ayuda F1
fr: Fichier d'&aide F1

source: &About
ar: &حول
es: &Acerca de
fr: A &propos

source: Qais Alrefai
ar: قيس الرفاعي

source: Mahmood atef
ar: محمود عاطف

source: Ahmed Bakr
ar: أحمد بكر

source: &Contact us
ar: &اتصل بنا
es: &Contacto
fr: &Contactez-nous

source: &Saved articles ctrl+S
ar: المقالات ال&محفوظة ctrl+S
es: Artí&culos guardados ctrl+S
fr: &Articles sauvegardés ctrl+S

source: &Favourite articles ctrl+F
ar: المقالات الم&فضلة ctrl+F
es: &Artículos favoritos ctrl+F
fr: &Articles favoris ctrl+F

source: &History ctrl+H
ar: الس&جل ctrl+H
es: Historial de artículos
fr: &Historique ctrl+H

source: Program &settings Alt+S
ar: &إعدادات البرنامج Alt+S
es: Ajustes del &programa Alt+S
fr: &réglages du programme Alt+S

source: Check for &update ctrl+u
ar: البحث عن ال&تحديثات ctrl+u
es: Buscar &actualización ctrl+u
fr: Vérifier la &se à jour ctrl+u

source: Close program ctrl+w
ar: إغلاق البرنامج ctrl+w
es: Cerrar el programa ctrl+w
fr: Fermer le programme ctrl+w

source: Main menu
ar: القائمة الرئيسية
es: Menú principal
fr: Menu principal

source: There is 1 open article.
ar: ثمة مقال واحد مفتوح.
es: Hay un artículo abierto.
fr: 1 article est ouvert.

source: There are {} open articles.
ar: ثمة {} من المقالات المفتوحة.
es: Hay {} artículos abiertos.
fr: {} articles sont ouverts.

source: {} Do you want to close the program anyway?
ar: {} هل تريد إغلاق البرنامج على أي حال؟
es: {} ¿Quiere cerrar el programa de todas maneras?
fr: {} Voulez-vous quand même fermer le programme ?

source: Confirm
ar: تأكيد
es: Confirmar
fr: Confirmer

source: Don't show that again
ar: لا تظهر ذلك مرة أخرى
es: No volver a mostrar
fr: Ne plus montrer cela

source: &No
ar: &لا
fr: &Non

source: &Yes
ar: &نعم
es: &Sí
fr: &Oui

source: {} Version {}. {} This program was developed by: Ahmed Bakr. Qais Alrifai. Mahmoud Atef.
ar: {} الإصدار {}. {} تم تطوير هذا البرنامج بواسطة: أحمد بَكْرْ. قيس الرفاعي. .\محمود عاطف.
es: {} Versión {}. {} Este programa fue desarrollado por: Ahmed Bakr. Qais Alrifai. Mahmoud Atef.
fr: {} Version {}. {} Ce programme a été développé par : Ahmed Bakr. Qais Alrifai. Mahmoud Atef.

source: About the program
ar: حول البرنامج
es: Sobre el programa
fr: A propos du programme

source: &Ok
ar: &موافق
es: &De acuerdo

source: A link to an article with the title {} has been detected in your clipboard.
ar: تم اكتشاف رابط مقال بعنوان {} في حافظتك.
es: Un link de un artículo con título {} ha sido detectado en su portapapeles.
fr: Un lien vers un article portant le titre {} a été détecté dans votre presse-papiers.

source: AutoDetect
ar: الاكتشاف التلقائي
es: Autodetectar
fr: Détection automatique

source: &Open in browser
ar: &فتح في المتصفح
es: &Abrir en el navegador
fr: &Ouvrir dans le navigateur

source: &Cancel
ar: &إلغاء
es: &Cancelar
fr: &Annuler

source: &View Article
ar: &عرض المقال
es: &Ver artículo
fr: &Afficher l'article

source: Connection error
ar: خطأ في الاتصال
es: Error de conexión
fr: Erreur de connexion

source: There is no internet connection.
ar: لا اتصال بالإنترنت.
es: No hay conexión a Internet.
fr: Pas de connexion internet.

source: No update available
ar: لا وجود لتحديثات
es: No hay actualizaciones disponibles
fr: Aucune mise à jour n'a été trouvée

source: You are using version {} which is the latest version.
ar: أنت تستخدم الإصدار {}وهو الإصدار الأخير.
es: Está usando la versión {} actualmente, la última versión.
fr: Vous utilisez la version {} qui se trouve être la dernière version.

source: Article references
ar: مراجع المقال
es: Referencias del artículo
fr: Références de l'article

source: Reference {}: {}
ar: المرجع {}: {}
es: Referencia {}: {}
fr: Référence {}: {}

source: Headings in this article
ar: العناوين في هذا المقال
es: Encabezados en este artículo
fr: Entêtes de cet article

source: Choose a heading
ar: اختر عنواناً
es: Elija un encabezado
fr: Choisissez une entête

source: &Go
ar: ال&ذهاب
es: &Ir
fr: &Aller

source: Tables in {}:
ar: الجداول في {}:
es: Tablas que hay en {}:
fr: Tableaux listés dans {}:

source: &Close
ar: &إغلاق
es: &Cerrar
fr: &Fermer

source: History
ar: السجل
es: Historial
fr: Historique

source: Search
ar: بحث
es: Buscar
fr: Recherche

source: Title
ar: العنوان
es: Título
fr: Titre

source: Date
ar: التاريخ
es: Fecha

source: Time
ar: الوقت
es: Hora
fr: Temps

source: Article language
ar: لغة المقال
es: Idioma del artículo
fr: Langue de l'article

source: &Copy article link
ar: &نسخ رابط المقال
es: &Copiar enlace del artículo
fr: &Copier le lien de l'article

source: &Delete
ar: &حذف
es: &Eliminar
fr: &Supprimer

source: The selected item has been deleted.
ar: تم حذف العنصر المحدد.
es: El ítem seleccionado ha sido eliminado.
fr: L'élément sélectionné a été supprimé.

source: Article link copied.
ar: تم نسخ رابط المقال.
es: Enlace del artículo copiado.
fr: Lien de l'article copié.

source: Error
ar: خطأ
fr: Erreur

source: This link cannot be copied.
ar: لا يمكن نسخ هذا الرابط.
es: No se puede copiar este enlace.
fr: Ce lien ne peut pas être copié.

source: Opening:
ar: يجري الفتح:
es: Abriendo:
fr: Ouverture de :

source: This link cannot be opened in the browser.
ar: لا يمكن فتح هذا الرابط في المتصفح.
es: Este enlace no se puede abrir en el navegador.
fr: Ce lien ne peut pas être ouvert dans le navigateur.

source: Favourite Articles
ar: المقالات المفضلة
es: Artículos Favoritos
fr: Articles favoris

source: &Rename
ar: إع&ادة التسمية
es: &Renombrar
fr: &Renommer

source: Choose the new name for the article.
ar: اختر الاسم الجديد للمقال.
es: Elija el nuevo nombre para el artículo.
fr: Choisissez le nouveau nom de l'article.

source: Rename the article
ar: أعد تسمية المقال
es: Renombrar artículo
fr: Renommer l'article

source: Saved Articles
ar: المقالات المحفوظة
es: Artículos Guardados
fr: Articles sauvegardés

source: Program Settings
ar: إعدادات البرنامج
es: Ajustes del programa
fr: Réglages du programme

source: Choose language:
ar: اختر اللغة:
es: Elija un idioma:
fr: Choisir la langue :

source: Choose your prefered view:
ar: اختر العارض المفضل لك:
es: Escoja la vista que prefiere:
fr: Choisir la méthode d'affichage préférée :

source: Normal View
ar: العارض العادي
es: Vista Normal
fr: Méthode d'affichage normale

source: Web View(Not recommended)
ar: عارض الويب (لا يوصى باستخدامه)
es: Vista Web (No recomendada)
fr: Méthode d'affichage Web (non recommandée)

source: Select the number of results:
ar: حدد عدد النتائج:
es: Seleccione el número de resultados:
fr: Sélectionnez le nombre de résultats :

source: Select the number of random articles:
ar: حدد عدد المقالات العشوائية:
es: Seleccione el número de artículos aleatorios:
fr: Sélectionnez le nombre d'articles choisis au hasard :

source: Show Close message when at least an article is open
ar: إظهار رسالة الإغلاق عندما يكون مقال واحد مفتوحاً على الأقل
es: Mostrar mensaje de cierre cuando haya al menos un artículo abierto
fr: Afficher le message de fermeture du programme lorsqu'au moins un article est ouvert

source: Auto detect links from the clipboard
ar: الاكتشاف التلقائي عن الروابط من الحافظة
es: Autodetectar links del portapapeles
fr: Détection automatique des liens à partir du presse-papiers

source: Check for updates automatically
ar: التحقق التلقائي من التحديثات
es: Buscar actualizaciones automáticamente
fr: Vérifier les mises à jour automatiquement

source: Close the article via the Escape key
ar: إغلاق المقال بواسطة مفتاح الهروب
es: Cerrar el artículo con la tecla escape
fr: Fermer l'article via la touche ÉchapClose the article via the Escape key

source: General
ar: عام
fr: Général

source: Delete history
ar: حذف السجل
es: Borrar historial
fr: Supprimer l'historique

source: Delete favourites
ar: حذف المفضلة
es: Borrar favoritos
fr: Supprimer les favoris

source: Delete saved articles
ar: حذف المقالات المحفوظة
es: Borrar artículos guardados
fr: Supprimer les articles sauvegardés

source: Reset to default settings
ar: إعادة تعيين الإعدادات الافتراضية
es: Restablecer a los ajustes por defecto
fr: Rétablir les paramètres par défaut

source: Advanced
ar: متقدم
es: Avanzado
fr: Avancé

source: &Save changes
ar: &حفظ التغييرات
es: &Guardar cambios
fr: &Sauvegarder les modifications

source: You must restart the program for the new language to take effect. Do you want to restart the program now?
ar: لتغيير اللغة, تحتاج إلى إعادة تشغيل البرنامج. هل تريد إعادة تشغيل البرنامج الآن؟
es: Debe reiniciar el programa para que el cambio de idioma sea efectivo. ¿Quiere reiniciar el programa ahora?
fr: Vous devez redémarrer le programme pour que la nouvelle langue prenne effet. Voulez-vous redémarrer le programme maintenant ?

source: Are you sure you want to reset all settings? The program will restart.
ar: هل تريد بالتأكيد إعادة تعيين كافة الإعدادات؟ ستتم إعادة تشغيل البرنامج.
es: ¿Está seguro de que desea restablecer todos los ajustes? El programa se reiniciará.
fr: Êtes-vous sûr de vouloir réinitialiser tous les paramètres ? Le programme va redémarrer.

source: Are you sure you want to delete the saved articles content?
ar: هل أنت متأكد أنك تريد حذف محتوى المقالات المحفوظة؟
es: ¿Está seguro de que quiere borrar el contenido de sus artículos guardados?
fr: Êtes-vous sûr de vouloir supprimer le contenu des articles sauvegardés ?

source: Are you sure you want to delete your favourites content?
ar: هل أنت متأكد أنك تريد حذف المحتوى المفضلة؟
es: ¿Está seguro de que quiere borrar su contenido de favoritos?
fr: Êtes-vous sûr de vouloir supprimer le contenu de vos favoris ?

source: Are you sure you want to delete the history content?
ar: هل أنت متأكد أنك تريد حذف محتوى السجل؟
es: ¿Está seguro de que quiere borrar el contenido del historial?
fr: Êtes-vous sûr de vouloir supprimer le contenu de l'historique ?

source: Update found
ar: تم العثور على تحديث
es: Se ha encontrado una actualización
fr: Mise à jour trouvée

source: Version {} is available.
ar: الإصدار {} متاح.
es: Versión {} disponible.

source: &Update
ar: &تحديث
es: &Actualizar
fr: &Mettre àjour

source: Downloading update
ar: يجري تنزيل التحديث
es: Descargando actualización
fr: Téléchargement de la mise à jour

source: Please wait.
ar: يرجى الانتظار.
es: Por favor Espere.
fr: Veuiller patienter.

source: View article
ar: عرض المقال
es: Ver artículo
fr: Voir l'article

source: &Copy article ctrl+shift+c
ar: & نسخ المقال \ tctrl + shift + c
es: Copiar artículo (ctrl+shift+c)
fr: Copier l'article ctrl+maj+c

source: &Copy article link alt+c
ar: &نسخ رابط المقال +alt+c
es: Copiar enlace del artículo (alt+c)
fr: Copier le lien de l'article +alt+c

source: Add to favourites ctrl+f
ar: إضافة إلى المفضلة ctrl+f
es: Añadir a favoritos ctrl+f
fr: Ajouter aux favoris ctrl+f

source: Add to saved articles ctrl+shift+s
ar: إضافة إلى المقالات المحفوظة ctrl+shift+s
es: Añadir en artículos guardados ctrl+shift+s
fr: Ajouter aux articles sauvegardés ctrl+maj+s

source: &Headings in article Ctrl+h
ar: العناوين &في المقال Ctrl+h
es: &Encabezados en el artículo Ctrl+h
fr: &entètes de l'article Ctrl+t

source: &References in article Ctrl+r
ar: الم&راجع في المقال Ctrl+r
es: &Referencias del artículo Ctrl+r
fr: &Références de l'article\tCtrl+r

source: &Tables in article Ctrl+t
ar: الج&داول في المقال Ctrl+t
es: &Tablas del artículo Ctrl+t
fr: &Tableaux de l'article Ctrl+t

source: &Linked articles Ctrl+l
ar: &المقالات المرتبطة Ctrl+l
es: &Artículos enlazados Ctrl+l
fr: &Articles présentés comme liens Ctrl+l

source: Go to
ar: الذهاب إلى
es: Ir a
fr: Aller à

source: Save article as &txt ctrl+shift+T
ar: حفظ المقال بصيغة &txt ctrl+shift+T
es: Guardar artículo en formato &txt ctrl+shift+T
fr: Sauvegarder l'article sous format &txt ctrl+shift+T

source: Save article as &html ctrl+shift+H
ar: حفظ المقال بصيغة &html ctrl+shift+H
es: Guardar artículo en formato &html ctrl+shift+H
fr: Sauvegarder l'article sous format &html ctrl+shift+H

source: Save article
ar: حفظ المقال
es: Guardar artículo
fr: Sauvegarder l'article

source: &Print ctrl+P
ar: &طباعة
es: &Imprimir ctrl+P
fr: &Imprimer ctrl+P

source: Close article window ctrl+w
ar: إغلاق نافذة المقال ctrl+w
es: Cerrar ventana del artículo ctrl+w
fr: Fermer la fenêtre de l'article ctrl+w

source: Close the program ctrl+F4
ar: إغلاق البرنامج ctrl+F4
es: Cerrar el programa ctrl+F4
fr: Fermer le programme ctrl+F4

source: Change &font Ctrl+d
ar: تغيير ال&خط Ctrl+d
es: Cambiar &fuente Ctrl+d
fr: Changer la &police Ctrl+d

source: &Change color ctrl+shift+d
ar: تغيير الل&ون ctrl+shift+d
es: &Cambiar color ctrl+shift+d
fr: &Changer la couleur ctrl+maj+d

source: Actions
ar: الإجراءات
es: Acciones

source: View
ar: العرض
es: Ver
fr: Méthode d'affichage

source: Copy article
ar: نسخ المقال
es: Copiar artículo
fr: Copier l'article

source: Copy article link
ar: نسخ رابط المقال
es: Copiar enlace del artículo
fr: Copier le lien de l'article

source: Close article
ar: إغلاق المقال
es: Cerrar artículo
fr: Fermer l'article

source: Loading article:
ar: يجري تحميل المقال:
es: Cargando artículo:
fr: Chargement de l'article :

source: This article is no longer available. do you want to show similar results for this article?
ar: هذا المقال لم يعد متاحاً. هل تريد إظهار نتائج مماثلة لهذا المقال؟
es: Este artículo ya no está disponible. ¿Quiere ver resultados similares?
fr: Cet article n'est plus disponible. voulez-vous montrer des résultats similaires pour cet article ?

source: Warning
ar: تحذير
es: Advertencia
fr: Avertissement

source: View {}
ar: عرض {}
es: Ver {}
fr: Afficher {}

source: Article loaded.
ar: تم تحميل المقال.
es: Artículo cargado.
fr: Article chargé.

source: Article copied.
ar: تم نسخ المقال.
es: Artículo copiado.
fr: Article copié.

source: Save {}:
ar: حفظ {}:
es: Guardar {}:
fr: Sauvegarder {}:

source: Linked articles
ar: المقالات المرتبطة
es: Artículos enlazados
fr: Articles présentés comme lien

source: Table {}: {}
ar: الجدول {}: {}
es: Tabla {}: {}
fr: Tableau {}: {}

source: Add to Favourites
ar: إضافة إلى المفضلة
es: Añadir a favoritos
fr: Ajouter aux Favoris

source: Choose the name of the article in your favourites.
ar: اختر اسم المقال في المفضلة.
es: Escoja el nombre del artículo para añadirlo a sus favoritos
fr: Choisissez le nom de l'article dans vos favoris.

source: &Add
ar: &إضافة
es: &Añadir
fr: &Ajouter

source: The article has been added to favourites.
ar: تمت إضافة المقال إلى المفضلة.
es: El artículo ha sido añadido a favoritos
fr: L'article a été ajouté aux favoris.

source: Add to saved articles
ar: إضافة إلى المقالات المحفوظة
es: Añadir a atículos guardados.
fr: Ajouter aux articles sauvegardés

source: Choose the name of the article in your saved articles.
ar: اختر اسم المقال في مقالاتك المحفوظة.
es: Elija el nombre del artículo en los artículos guardados
fr: Choisissez le nom de l'article dans vos articles sauvegardés.

source: The article has been added to your saved articles.
ar: تمت إضافة المقال إلى مقالاتك المحفوظة.
es: El artículo ha sido añadido a sus artículos guardados
fr: L'article a été ajouté à vos articles sauvegardés.

source: Lines: {}.
ar: السطور: {}.
es: Líneas: {}.
fr: Lignes : {}.

source: Paragraphs: {}.
ar: الفقرات: {}.
es: Párrafos: {}.
fr: Paragraphes : {}.

source: Sentences: {}.
ar: الجمل: {}.
es: Frases: {}.
fr: Phrases : {}.

source: Words: {}.
ar: الكلمات: {}.
es: Palabras: {}.
fr: Mots : {}.

source: Characters: {}.
ar: الحروف: {}.
es: Carácteres: {}.
fr: Lettres {}.

source: Search results
ar: نتائج البحث
es: Resultados de búsqueda
fr: Résultats de recherche

source: Go&Back
ar: &رجوع
es: &Atrás
fr: &Retourner

source: Random articles
ar: المقالات العشوائية
es: Artículos aleatorios
fr: Articles choisis au hasard

source: We couldn't find any articles that match your search.
ar: لم نتمكن من العثور على أي مقالات تطابق بحثك.
es: No se ha podido encontrar ningún artículo que cumpla con su búsqueda.
fr: Aucun article correspondant à votre recherche n'a pu être trouvé.

source: <h1>Please wait</h1>
ar: <h1>يرجى الانتظار</h1>
es: <h1>Por favor espere</h1>
fr: <h1>Veuiller patienter</h1>
